proc listFromFile {filename} {
    set f [open $filename r]
    set data [split [string trim [read $f]]]
    close $f
    return $data
}

set SRAM_TOP_HOME    $env(SRAM_TOP_HOME)
set BOS_LIB_HOME     $env(BOS_LIB_HOME)
set DK_HOME          $env(DK_HOME)

set BOS_LOGICR       "$BOS_LIB_HOME/bos_logic/RVT"
set BOS_LOGICL       "$BOS_LIB_HOME/bos_logic/LVT"
set BOS_LOGIC2       "$BOS_LIB_HOME/bos_logic/CLK_RST_LVT"

set SYNOPSYS_ROOT    "/home/bossemi/synopsys/tool/syn/S-2021.06-SP5-3"
set DK_ROOT          "$DK_HOME/logic"

set DESIGN_TOP "AOU_RX_CORE"
set DESIGN_TOP_NEW "AOU_RX_CORE_NEW"

source ./1_set_env_var.tcl
source ./2_set_library.tcl

########################################################################
# Formality Verification Script generated by:
# fm_mk_script -output setup.fms "default.svf"
# Formality (R) Version E-2010.12 -- Oct 19, 2010
# Copyright (C) 2007-2010 Synopsys, Inc. All rights reserved.
########################################################################

########################################################################
# Synopsys Auto Setup Mode
########################################################################

set_app_var synopsys_auto_setup false
set_app_var hdlin_error_on_mismatch_message false
set_app_var verification_set_undriven_signals binary
set_app_var verification_passing_mode Equality

set_app_var hdlin_interface_only "SRAM_2P*"
# Note: The Synopsys Auto Setup mode is less conservative than the
# Formality default mode, and is more likely to result in a successful
# verification out-of-the-box.
#
# Setting synopsys_auto_setup changes the values of the variables
# listed here below. You may change any of these variables back to
# their default settings to be more conservative. Uncomment the
# appropriate lines below to revert back to their default settings:
# set_app_var hdlin_ignore_parallel_case true
# set_app_var hdlin_ignore_full_case true
# set_app_var verification_verify_directly_undriven_output true
# set_app_var hdlin_ignore_embedded_configuration false
# set_app_var svf_ignore_unqualified_fsm_information true
########################################################################
# Setup for instantiated or function-inferred DesignWare components
########################################################################

set_app_var hdlin_dwroot /data/tools/Synopsys/syn/T-2022.03-SP5

########################################################################
# Search path

# from the System Variable Group 
set search_path $LIBRARY_DIR

##############################################################
########################################################################
# Read in the SVF file(s)
########################################################################
# Define design libs
########################################################################
define_design_lib -r -path ./work work
########################################################################
# Read in the libraries
########################################################################
read_db -technology_library $TARGET_LIBRARY_FILES 
########################################################################
########################################################################
# set_app_var link_library * lsi_10k.db dw_foundation.sldb
#######################################################################
# Read in the Reference Design as Verilog or VHDL source code
########################################################################

read_sverilog -r -libname work -vcs "-f $AOU_CORE_HOME/RTL/filelist.f" -define SYNTHESIS
set_top r:/WORK/${DESIGN_TOP}


########################################################################
# Read in the Implementation Design created from Design Compiler
#
# Choose the file that you want to verify
########################################################################

read_sverilog -i -libname work -vcs "/workspace/project/N1B0/design/parkthi/project/B0/IP/AOU_CORE/RTL/SAFETY/AOU_RX_CORE_DCLS_NEW.v -f $AOU_CORE_HOME/RTL/filelist.f" -define SYNTHESIS
set_top i:/WORK/${DESIGN_TOP_NEW}

#set_top -auto
source ./3_set_user_match.tcl
source ./4_set_dont_verify_points.tcl

########################################################################
# Verify and Report
#
# If the verification is not successful, the session is saved and reports
# are generated to help debug the failed or inconclusive verification.
########################################################################
if { ![verify] } {
	set DESIGN_NAME $DESIGN_TOP ;# The name of the top-level design
	set FMRM_FAILING_SESSION_NAME ${DESIGN_NAME}
	set FMRM_FAILING_POINTS_REPORT ${DESIGN_NAME}.fmv_failing_points.rpt
	set FMRM_ABORTED_POINTS_REPORT ${DESIGN_NAME}.fmv_aborted_points.rpt
	set FMRM_ANALYZE_POINTS_REPORT ${DESIGN_NAME}.fmv_analyze_points.rpt
	set FMRM_FAILING_POINTS_DATAPATH_REPORT ${DESIGN_NAME}.fmv_failing_points_datapath.rpt
	set FMRM_UNMATCHED_POINTS_REPORT ${DESIGN_NAME}.fmv_unmatched_points.rpt
	set FMRM_MATCHED_POINTS_REPORT ${DESIGN_NAME}.fmv_matched_points.rpt
	set REPORTS_DIR "reports"
	file mkdir ${REPORTS_DIR}
	save_session -replace ${REPORTS_DIR}/${FMRM_FAILING_SESSION_NAME}
	report_failing_points > ${REPORTS_DIR}/${FMRM_FAILING_POINTS_REPORT}
	report_aborted_points > ${REPORTS_DIR}/${FMRM_ABORTED_POINTS_REPORT}
    analyze_points -all > ${REPORTS_DIR}/${FMRM_ANALYZE_POINTS_REPORT}
    report_unmatched_points -datapath > ${REPORTS_DIR}/${FMRM_FAILING_POINTS_DATAPATH_REPORT}
    report_unmatched_points > ${REPORTS_DIR}/${FMRM_UNMATCHED_POINTS_REPORT}
    report_matched_points > ${REPORTS_DIR}/${FMRM_MATCHED_POINTS_REPORT}
    exec figlet "Failed"
} else {
	set DESIGN_NAME $DESIGN_TOP ;# The name of the top-level design
	set FMRM_FAILING_SESSION_NAME ${DESIGN_NAME}
	set FMRM_FAILING_POINTS_REPORT ${DESIGN_NAME}.fmv_failing_points.rpt
	set FMRM_ABORTED_POINTS_REPORT ${DESIGN_NAME}.fmv_aborted_points.rpt
	set FMRM_ANALYZE_POINTS_REPORT ${DESIGN_NAME}.fmv_analyze_points.rpt
	set FMRM_UNMATCHED_POINTS_REPORT ${DESIGN_NAME}.fmv_unmatched_points.rpt
	set FMRM_MATCHED_POINTS_REPORT ${DESIGN_NAME}.fmv_matched_points.rpt
	set REPORTS_DIR "reports"
	file mkdir ${REPORTS_DIR}
	save_session -replace ${REPORTS_DIR}/${FMRM_FAILING_SESSION_NAME}
	report_failing_points > ${REPORTS_DIR}/${FMRM_FAILING_POINTS_REPORT}
	report_aborted_points > ${REPORTS_DIR}/${FMRM_ABORTED_POINTS_REPORT}
    analyze_points -all > ${REPORTS_DIR}/${FMRM_ANALYZE_POINTS_REPORT}
    report_unmatched_points > ${REPORTS_DIR}/${FMRM_UNMATCHED_POINTS_REPORT}
    report_matched_points > ${REPORTS_DIR}/${FMRM_MATCHED_POINTS_REPORT}
    exec figlet "Passed"
}

exit
